<?php

// +----------------------------------------------------------------------
// | Library for ThinkAdmin
// +----------------------------------------------------------------------
// | 版权所有 2014~2025 ThinkAdmin [ thinkadmin.top ]
// +----------------------------------------------------------------------
// | 官方网站: https://thinkadmin.top
// +----------------------------------------------------------------------
// | 开源协议 ( https://mit-license.org )
// | 免费声明 ( https://thinkadmin.top/disclaimer )
// +----------------------------------------------------------------------
// | gitee 仓库地址 ：https://gitee.com/zoujingli/ThinkLibrary
// | github 仓库地址 ：https://github.com/zoujingli/ThinkLibrary
// +----------------------------------------------------------------------

declare (strict_types=1);

use think\admin\Library;
use think\admin\model\SystemBase;

// 动态读取繁体数据字典
if (count($langs = Library::$sapp->cache->get('lang-zh-tw', [])) < 1) {
    $langs = array_column(SystemBase::items('繁体中文'), 'name', 'code');
    $menus = array_column(SystemBase::items('繁体菜单'), 'name', 'code');
    foreach ($menus as $key => $name) $langs["menus_{$key}"] = $name;
    Library::$sapp->cache->set('lang-zh-tw', $langs, 360);
}

$extra = [];
$extra['Y年m月d日 H:i:s'] = 'Y年m月d日 H:i:s';
$extra['请重新登录！'] = '登錄授權無效，請重新登錄！';
$extra['共 %s 条记录，每页显示 %s 条，共 %s 页当前显示第 %s 页。'] = '共 %s 條記錄，每頁顯示 %s 條，共 %s 頁當前顯示第 %s 頁。';

return array_merge([
    // 接口提示内容
    '数据删除成功！'         => '數據刪除成功！',
    '数据删除失败！'         => '數據刪除失敗！',
    '数据保存成功！'         => '數據保存成功！',
    '数据保存失败！'         => '數據保存失敗！',
    '数据排序成功！'         => '數據排序成功！',
    '列表排序失败！'         => '列表排序失敗！',
    '请求响应异常！'         => '請求響應異常！',
    '请求响应成功！'         => '請求響應成功！',
    '未授权禁止访问！'       => '未授權禁止訪問！',
    '会话无效或已失效！'     => '會話無效或已失效！',
    '表单令牌验证失败！'     => '表單令牌驗證失敗！',
    '接口账号验证失败！'     => '接口账号验证失败！',
    '接口请求时差过大！'     => '接口請求時差過大！',
    '接口签名验证失败！'     => '接口簽名驗證失敗！',
    '非JWT访问！'            => '請使用 JWT 方式訪問！',
    '请求参数 %s 不能为空！' => '請求參數 %s 不能爲空！',
    '接口请求响应格式异常！' => '接口請求響應格式異常！',
    '耗时 %.4f 秒'          => '耗時 %.4f 秒',
    '创建任务失败，%s'       => '創建任務失敗，%s',
    '已创建请等待处理完成！' => '已創建請等待處理完成！',
    '删除%s[%s]及授权配置'  => '刪除%s[%s]及授權配置',
    '暂无轨迹信息~'         => '暫無軌迹信息~',
    // 存储引擎翻译
    '本地服务器存储'        => '本地服務器存儲',
    '自建Alist存储'         => '自建Alist存儲',
    '七牛云对象存储'        => '七牛雲對象存儲',
    '又拍云USS存储'         => '又拍雲USS存儲',
    '阿里云OSS存储'         => '阿裏雲OSS存儲',
    '腾讯云COS存储'         => '騰訊雲COS存儲',
    '未配置又拍云域名'      => '未配置又拍雲域名',
    '未配置阿里云域名'      => '未配置阿裏雲域名',
    '未配置七牛云域名'      => '未配置七牛雲域名',
    '未配置腾讯云域名'      => '未配置腾讯云域名',
    '未配置Alist域名'       => '未配置Alist域名',
    // 默认日志翻译
    '增加%s[%s]成功'        => '增加%s[%s]成功',
    '修改%s[%s]状态'        => '修改%s[%s]狀態',
    '更新%s[%s]记录'        => '更新%s[%s]記錄',
    '删除%s[%s]成功'        => '刪除%s[%s]成功',
], $extra, $langs);